WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
  /* Construct I2C address for global register:
   * Extract C1,C0 bits from register address (bits 5-4) and combine with base_addr */
  uint8_t c1c0_bits = (reg >> 4) & 0x03;  /* Extract C1,C0 from register */
  i2c_addr = priv->base_addr | (c1c0_bits << 1) | WK2132_ADDR_REG_ACCESS;

  syslog(LOG_DEBUG, "WK2132: Write global reg=0x%02x, value=0x%02x, i2c_addr=0x%02x\n",
         reg, value, i2c_addr);

  /* Setup data buffer */
  buffer[0] = reg & 0x0F;  /* Use lower 4 bits as actual register address */
  buffer[1] = value;

  /* Setup I2C message */
  msg.frequency = WK2132_I2C_FREQUENCY;
  msg.addr      = i2c_addr;
  msg.flags     = 0;
  msg.buffer    = buffer;
  msg.length    = 2;

  /* Perform the transfer */
  ret = I2C_TRANSFER(priv->i2c, &msg, 1);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Global write failed - reg=0x%02x, ret=%d\n", reg, ret);
    }
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Read from a global register via I2C
 *
 * Use this function for global registers that are not channel-specific:
 * - WK2132_GENA (Global Enable Register)
 * - WK2132_GRST (Global Reset Register)
 * - WK2132_GMUT (Global Master IRQ Enable)
 * - WK2132_GIER (Global IRQ Enable Register)
 * - WK2132_GIFR (Global IRQ Flag Register)
 */
static int wk2132_i2c_read_global(FAR struct wk2132_dev_s *priv, uint8_t reg,
                                   FAR uint8_t *value)
{
  struct i2c_msg_s msgs[2];
  uint8_t i2c_addr;
  int ret;

  /* Construct I2C address for global register:
   * Extract C1,C0 bits from register address (bits 5-4) and combine with base_addr */
  uint8_t c1c0_bits = (reg >> 4) & 0x03;  /* Extract C1,C0 from register */
  uint8_t reg_addr = reg & 0x0F;          /* Use lower 4 bits as actual register address */
  i2c_addr = priv->base_addr | (c1c0_bits << 1) | WK2132_ADDR_REG_ACCESS;

  syslog(LOG_DEBUG, "WK2132: Read global reg=0x%02x, i2c_addr=0x%02x\n", reg, i2c_addr);

  /* Setup I2C write message for register address */
  msgs[0].frequency = WK2132_I2C_FREQUENCY;
  msgs[0].addr      = i2c_addr;
  msgs[0].flags     = 0;
  msgs[0].buffer    = &reg_addr;
  msgs[0].length    = 1;

  /* Setup I2C read message for data */
  msgs[1].frequency = WK2132_I2C_FREQUENCY;
  msgs[1].addr      = i2c_addr;
  msgs[1].flags     = I2C_M_READ;
  msgs[1].buffer    = value;
  msgs[1].length    = 1;

  /* Perform the transfer */
  ret = I2C_TRANSFER(priv->i2c, msgs, 2);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Global read failed - reg=0x%02x, ret=%d\n", reg, ret);
    }
  else
    {
      syslog(LOG_DEBUG, "WK2132: Global read success - reg=0x%02x, value=0x%02x\n", reg, *value);
    }
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Write a channel-specific register via I2C
 *
 * Use this function for channel-specific registers:
 * - WK2132_SPAGE (Sub-page Select Register)
 * - WK2132_SCR (Sub-channel Control Register)
 * - WK2132_LCR (Line Control Register)
 * - WK2132_FCR (FIFO Control Register)
 * - WK2132_SIER (Sub-channel IRQ Enable Register)
 * - WK2132_SIFR (Sub-channel IRQ Flag Register)
 * - WK2132_FSR (FIFO Status Register)
 * - WK2132_LSR (Line Status Register)
 * - And baud rate registers (BAUD1, BAUD0, PRES) in sub-page 1
 */
static int wk2132_i2c_write_reg(FAR struct wk2132_dev_s *priv, uint8_t reg,
                                 uint8_t value)
{
  struct i2c_msg_s msg;
  uint8_t buffer[2];
  uint8_t i2c_addr;
  int ret;

  /* Construct I2C address: base_addr in bits 6-3, channel in bits 2-1, reg access in bit 0 */
  i2c_addr = WK2132_MAKE_I2C_ADDR(priv->base_addr, priv->port, false);

  /* Setup data buffer */
  buffer[0] = reg;
  buffer[1] = value;

  /* Setup I2C message */
  msg.frequency = WK2132_I2C_FREQUENCY;
  msg.addr      = i2c_addr;
  msg.flags     = 0;
  msg.buffer    = buffer;
  msg.length    = 2;

  /* Perform the transfer */
  ret = I2C_TRANSFER(priv->i2c, &msg, 1);
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Read a channel-specific register via I2C
 *
 * Use this function for channel-specific registers:
 * - WK2132_SPAGE (Sub-page Select Register)
 * - WK2132_SCR (Sub-channel Control Register)
 * - WK2132_LCR (Line Control Register)
 * - WK2132_FCR (FIFO Control Register)
 * - WK2132_SIER (Sub-channel IRQ Enable Register)
 * - WK2132_SIFR (Sub-channel IRQ Flag Register)
 * - WK2132_FSR (FIFO Status Register)
 * - WK2132_LSR (Line Status Register)
 * - And baud rate registers (BAUD1, BAUD0, PRES) in sub-page 1
 */
static int wk2132_i2c_read_reg(FAR struct wk2132_dev_s *priv, uint8_t reg,
                                FAR uint8_t *value)
{
  struct i2c_msg_s msgs[2];
  uint8_t i2c_addr;
  int ret;

  /* Construct I2C address: base_addr in bits 6-3, channel in bits 2-1, reg access in bit 0 */
  i2c_addr = WK2132_MAKE_I2C_ADDR(priv->base_addr, priv->port, false);

  /* Setup I2C write message for register address */
  msgs[0].frequency = WK2132_I2C_FREQUENCY;
  msgs[0].addr      = i2c_addr;
  msgs[0].flags     = 0;
  msgs[0].buffer    = &reg;
  msgs[0].length    = 1;

  /* Setup I2C read message for data */
  msgs[1].frequency = WK2132_I2C_FREQUENCY;
  msgs[1].addr      = i2c_addr;
  msgs[1].flags     = I2C_M_READ;
  msgs[1].buffer    = value;
  msgs[1].length    = 1;

  /* Perform the transfer */
  ret = I2C_TRANSFER(priv->i2c, msgs, 2);
  return (ret >= 0) ? OK : ret;
}

/**
 * @brief Write to FIFO via I2C (single byte)
 *
 * As shown in timing diagram 11.2.3, FIFO write operations send data directly
 * to the FIFO without specifying a register address.
 */
static int wk2132_i2c_write_fifo(FAR struct wk2132_dev_s *priv, uint8_t value)
{
  struct i2c_msg_s msg;
  uint8_t i2c_addr;
  int ret;

  /* Construct I2C address: base_addr in bits 6-3, channel in bits 2-1, FIFO access in bit 0 */
  i2c_addr = WK2132_MAKE_I2C_ADDR(priv->base_addr, priv->port, true);

  /* Setup I2C message - direct data write to FIFO as per timing diagram */
  msg.frequency = WK2132_I2C_FREQUENCY;
  msg.addr      = i2c_addr;
  msg.flags     = 0;
  msg.buffer    = &value;
  msg.length    = 1;

