WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
  syslog(LOG_DEBUG, "WK2132: Reset completed for port %d, GRST=0x%02x\n", priv->port, grst);

  /* Step 3: Sub UART global interrupt enable (DFRobot: subSerialGlobalRegEnable(subUartChannel, intrpt)) */
  syslog(LOG_DEBUG, "WK2132: Sub UART global interrupt enable for port %d\n", priv->port);
  ret = wk2132_i2c_read_global(priv, WK2132_GIER, &gier);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to read GIER register for port %d\n", priv->port);
      goto errout;
    }

  uint8_t gier_bit = 1 << (priv->port - 1);
  gier |= gier_bit;
  ret = wk2132_i2c_write_global(priv, WK2132_GIER, gier);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to write GIER register for port %d\n", priv->port);
      goto errout;
    }

  syslog(LOG_DEBUG, "WK2132: Global interrupt enabled for port %d, GIER=0x%02x\n", priv->port, gier);

  /* Step 4: Sub UART page register setting (default PAGE0) */
  syslog(LOG_DEBUG, "WK2132: Sub UART page register setting (default PAGE0) for port %d\n", priv->port);
  ret = wk2132_i2c_write_reg(priv, WK2132_SPAGE, 0);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to set page 0 for port %d\n", priv->port);
      goto errout;
    }

  /* Step 5: Sub interrupt setting - Enable multiple interrupt sources like DFRobot */
  syslog(LOG_DEBUG, "WK2132: Sub interrupt setting for port %d\n", priv->port);
  uint8_t sier = WK2132_SIER_RFTRIG_IEN |   /* RX FIFO trigger interrupt */
                 WK2132_SIER_RXOUT_IEN |    /* RX timeout interrupt */
                 WK2132_SIER_TFTRIG_IEN |   /* TX FIFO trigger interrupt */
                 WK2132_SIER_TFEMPTY_IEN |  /* TX FIFO empty interrupt */
                 WK2132_SIER_FERR_IEN;      /* Frame error interrupt */

  ret = wk2132_i2c_write_reg(priv, WK2132_SIER, sier);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to write SIER register for port %d\n", priv->port);
      goto errout;
    }

  syslog(LOG_DEBUG, "WK2132: Set SIER=0x%02x for port %d\n", sier, priv->port);

  /* Step 6: Enable transmit/receive FIFO with reset (DFRobot style) */
  syslog(LOG_DEBUG, "WK2132: Enable transmit/receive FIFO for port %d\n", priv->port);

  /* DFRobot FCR configuration: {.rfRst = 0x01, .tfRst = 0x00, .rfEn = 0x01, .tfEn = 0x01, .rfTrig = 0x00, .tfTrig = 0x00} */
  uint8_t fcr_current = 0;

  /* Read current FCR value first (DFRobot subSerialRegConfig pattern) */
  ret = wk2132_i2c_read_reg(priv, WK2132_FCR, &fcr_current);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to read FCR register for port %d\n", priv->port);
      goto errout;
    }

  syslog(LOG_DEBUG, "WK2132: Current FCR=0x%02x for port %d\n", fcr_current, priv->port);

  /* Apply DFRobot FCR settings using OR operation like subSerialRegConfig */
  uint8_t fcr_settings = WK2132_FCR_RFRST |     /* Reset RX FIFO (rfRst = 1) */
                         WK2132_FCR_TFRST |     /* Reset TX FIFO (tfRst = 1) */
                         WK2132_FCR_RFEN |      /* Enable RX FIFO (rfEn = 1) */
                         WK2132_FCR_TFEN;       /* Enable TX FIFO (tfEn = 1) */
                         /* Trigger levels default to 0 (rfTrig = 0, tfTrig = 0) */

  uint8_t fcr_new = fcr_current | fcr_settings;

  ret = wk2132_i2c_write_reg(priv, WK2132_FCR, fcr_new);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to write FCR register for port %d\n", priv->port);
      goto errout;
    }

  /* Read back for verification */
  uint8_t fcr_verify = 0;
  wk2132_i2c_read_reg(priv, WK2132_FCR, &fcr_verify);
  syslog(LOG_DEBUG, "WK2132: Set FCR=0x%02x (was 0x%02x, wrote 0x%02x) for port %d\n",
         fcr_verify, fcr_current, fcr_new, priv->port);


  /* Configure LCR based on settings according to datasheet */
  /* Note: WK2132 supports only 8-bit data length (fixed) */
  /* LCR Register bits from datasheet image:
   * Bit 6: Reserved (0)
   * Bit 5: BREAK - Line Break output enable
   * Bit 4: IREN - IR mode enable
   * Bit 3: PAEN - Parity enable
   * Bit 2-1: PAM1-0 - Parity mode (10=Even, 01=Odd, 00=Reserved, 11=Mark/Space)
   * Bit 0: STB - Stop bits (0=1bit, 1=2bits)
   */

  /* Configure stop bits */
  if (priv->stopbits2)
    {
      lcr |= WK2132_LCR_STB;  /* 2 stop bits */
    }

  /* Configure parity according to datasheet and termios standards */
  switch (priv->parity)
    {
    case 0:  /* No parity */
      /* PAEN=0, no parity bits needed */
      break;
    case 1:  /* Odd parity */
      lcr |= WK2132_LCR_PAEN | WK2132_LCR_PAM0;  /* Enable parity, PAM1=0,PAM0=1 for odd */
      break;
    case 2:  /* Even parity */
      lcr |= WK2132_LCR_PAEN | WK2132_LCR_PAM1;  /* Enable parity, PAM1=1,PAM0=0 for even */
      break;
    default:
      syslog(LOG_WARNING, "WK2132: Invalid parity mode %lu, using no parity\n", (unsigned long)priv->parity);
      break;
    }

  ret = wk2132_i2c_write_reg(priv, WK2132_LCR, lcr);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to write LCR register for port %d\n", priv->port);
      goto errout;
    }

  syslog(LOG_DEBUG, "WK2132: Set LCR=0x%02x for port %d\n", lcr, priv->port);

  /* Set baud rate */
  ret = wk2132_set_baud(priv, priv->baud);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to set baud rate %lu for port %d\n", (unsigned long)priv->baud, priv->port);
      goto errout;
    }

  syslog(LOG_DEBUG, "WK2132: Set baud rate %lu for port %d\n", (unsigned long)priv->baud, priv->port);

  /* Step 7: Sub UART receive/transmit enable (DFRobot: sScrReg_t scr = {.rxEn = 0x01, .txEn = 0x01, .sleepEn = 0x00, .rsv = 0x00}) */
  syslog(LOG_DEBUG, "WK2132: Sub UART receive/transmit enable for port %d\n", priv->port);
  uint8_t scr = WK2132_SCR_RXEN | WK2132_SCR_TXEN;  /* Enable RX and TX, disable sleep mode */

  ret = wk2132_i2c_write_reg(priv, WK2132_SCR, scr);
  if (ret < 0)
    {
      syslog(LOG_ERR, "WK2132: Failed to write SCR register for port %d\n", priv->port);
      goto errout;
    }

  syslog(LOG_DEBUG, "WK2132: Set SCR=0x%02x for port %d (RX/TX enabled)\n", scr, priv->port);

  priv->enabled = true;

  syslog(LOG_INFO, "WK2132: Setup completed successfully for port %d\n", priv->port);

  /* Start polling if not already started */
  if (!g_wk2132_poll_started)
    {
      g_wk2132_poll_started = true;
      work_queue(LPWORK, &g_wk2132_poll_work, wk2132_poll_worker, NULL, 0);
    }

errout:
  nxsem_post(&priv->exclsem);
  return ret;
}

/**
 * @brief Shutdown UART port
 */
static void wk2132_shutdown(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t gena;

  /* Disable all interrupts */
  wk2132_i2c_write_reg(priv, WK2132_SIER, 0x00);

