WfHit/wheel_loader/platforms/nuttx/src/px4/stm/stm32_common/serial/wk2132.c
  /* Disable the UART port in global register */
  if (wk2132_i2c_read_global(priv, WK2132_GENA, &gena) >= 0)
    {
      uint8_t gena_bit = 1 << (priv->port - 1);
      gena &= ~gena_bit;
      wk2132_i2c_write_global(priv, WK2132_GENA, gena);
    }

  priv->enabled = false;
}

/**
 * @brief Attach interrupt (not used in polled mode)
 */
static int wk2132_attach(FAR struct uart_dev_s *dev)
{
  return OK;
}

/**
 * @brief Detach interrupt (not used in polled mode)
 */
static void wk2132_detach(FAR struct uart_dev_s *dev)
{
  /* Nothing to do */
}

/**
 * @brief IOCTL handler
 */
static int wk2132_ioctl(FAR struct file *filep, int cmd, unsigned long arg)
{
  FAR struct inode *inode = filep->f_inode;
  FAR struct uart_dev_s *dev = inode->i_private;
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  int ret = OK;

  switch (cmd)
    {
    case TCGETS:
      {
        FAR struct termios *termiosp = (FAR struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Return current settings */
        termiosp->c_cflag = 0;

        /* WK2132 only supports 8-bit data according to datasheet */
        termiosp->c_cflag |= CS8;

        if (priv->stopbits2)
          {
            termiosp->c_cflag |= CSTOPB;
          }

        if (priv->parity == 1)
          {
            termiosp->c_cflag |= PARENB | PARODD;
          }
        else if (priv->parity == 2)
          {
            termiosp->c_cflag |= PARENB;
          }

        /* Set baud rate */
        cfsetispeed(termiosp, priv->baud);
        cfsetospeed(termiosp, priv->baud);
      }
      break;

    case TCSETS:
      {
        FAR struct termios *termiosp = (FAR struct termios *)arg;

        if (!termiosp)
          {
            ret = -EINVAL;
            break;
          }

        /* Extract new settings */
        priv->baud = cfgetispeed(termiosp);

        /* WK2132 only supports 8-bit data according to datasheet */
        priv->nbits = 8;

        priv->stopbits2 = (termiosp->c_cflag & CSTOPB) != 0;

        if (termiosp->c_cflag & PARENB)
          {
            priv->parity = (termiosp->c_cflag & PARODD) ? 1 : 2;
          }
        else
          {
            priv->parity = 0;
          }

        /* Reconfigure the UART */
        wk2132_setup(dev);
      }
      break;

    default:
      ret = -ENOTTY;
      break;
    }

  return ret;
}

/**
 * @brief Receive character
 */
static int wk2132_receive(FAR struct uart_dev_s *dev, unsigned int *status)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;
  uint8_t lsr;
  uint8_t rxdata;
  int ret;

  /* Get FIFO status */
  ret = wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr);
  if (ret < 0)
    {
      return -EIO;
    }

  /* Get line status */
  ret = wk2132_i2c_read_reg(priv, WK2132_LSR, &lsr);
  if (ret < 0)
    {
      return -EIO;
    }

  *status = (fsr << 8) | lsr;

  /* Read data from FIFO */
  ret = wk2132_i2c_read_fifo(priv, &rxdata);
  if (ret < 0)
    {
      return -EIO;
    }

  return rxdata;
}

/**
 * @brief Enable/disable RX interrupt
 */
static void wk2132_rxint(FAR struct uart_dev_s *dev, bool enable)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t sier;

  /* Read current interrupt enable register */
  if (wk2132_i2c_read_reg(priv, WK2132_SIER, &sier) < 0)
    {
      return;
    }

  /* Enable/disable RX interrupt */
  if (enable)
    {
      sier |= WK2132_SIER_RFTRIG_IEN;
    }
  else
    {
      sier &= ~WK2132_SIER_RFTRIG_IEN;
    }

  wk2132_i2c_write_reg(priv, WK2132_SIER, sier);
}

/**
 * @brief Check if RX data available
 */
static bool wk2132_rxavailable(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;

  if (!priv->enabled)
    {
      return false;
    }

  /* Check FIFO status register for available data */
  if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) < 0)
    {
      return false;
    }

  return (fsr & WK2132_FSR_RDAT) != 0;
}

/**
 * @brief Send character
 */
static void wk2132_send(FAR struct uart_dev_s *dev, int ch)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;

  /* Write data to FIFO */
  wk2132_i2c_write_fifo(priv, (uint8_t)ch);
}

/**
 * @brief Enable/disable TX interrupt
 */
static void wk2132_txint(FAR struct uart_dev_s *dev, bool enable)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t sier;

  /* Read current interrupt enable register */
  if (wk2132_i2c_read_reg(priv, WK2132_SIER, &sier) < 0)
    {
      return;
    }

  /* Enable/disable TX interrupt */
  if (enable)
    {
      sier |= WK2132_SIER_TFTRIG_IEN;
    }
  else
    {
      sier &= ~WK2132_SIER_TFTRIG_IEN;
    }

  wk2132_i2c_write_reg(priv, WK2132_SIER, sier);
}

/**
 * @brief Check if TX ready
 */
static bool wk2132_txready(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;

  if (!priv->enabled)
    {
      return false;
    }

  /* Check FIFO status register */
  if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) < 0)
    {
      return false;
    }

  /* Return true if TX FIFO is not full */
  return (fsr & WK2132_FSR_TFULL) == 0;
}

/**
 * @brief Check if TX empty
 */
static bool wk2132_txempty(FAR struct uart_dev_s *dev)
{
  FAR struct wk2132_dev_s *priv = (FAR struct wk2132_dev_s *)dev->priv;
  uint8_t fsr;

  if (!priv->enabled)
    {
      return true;
    }

  /* Check FIFO status register */
  if (wk2132_i2c_read_reg(priv, WK2132_FSR, &fsr) < 0)
    {
      return false;
    }

  /* Return true if TX is not busy and no data available */
  return ((fsr & WK2132_FSR_TBUSY) == 0) && ((fsr & WK2132_FSR_TDAT) == 0);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/**
 * @brief Initialize a WK2132 UART port
 */
FAR struct uart_dev_s *wk2132_uart_init(FAR struct i2c_master_s *i2c,
                                         uint8_t base_addr, uint8_t port)
{
  FAR struct wk2132_dev_s *priv;
  FAR struct uart_dev_s *dev;
  int ret;

  /* Enable debug logging for WK2132 driver */
  setlogmask(LOG_UPTO(LOG_DEBUG));

  syslog(LOG_INFO, "WK2132: Initializing port %d with base_addr 0x%02x\n", port, base_addr);

  /* Validate parameters */
  if (!i2c || port < 1 || port > WK2132_MAX_PORTS)
    {
      syslog(LOG_ERR, "WK2132: Invalid parameters - i2c=%p, port=%d (valid range 1-%d)\n",
             i2c, port, WK2132_MAX_PORTS);
      return NULL;
    }

  /* Allocate device structures */
  priv = (FAR struct wk2132_dev_s *)kmm_zalloc(sizeof(struct wk2132_dev_s));
  if (priv == NULL)
    {
      syslog(LOG_ERR, "WK2132: Failed to allocate private structure for port %d\n", port);
      return NULL;
    }

